Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You
have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10
jobs data.
This task will be done in following steps:
1. First get the webpage https://www.naukri.com/
2. Enter “Data Analyst” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the
location” field.
3. Then click the search button.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.

In [8]:
!pip install selenium

Requirement already satisfied: selenium in c:\users\admin\anaconda3\lib\site-packages (4.4.3)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (0.9.2)
Requirement already satisfied: trio~=0.17 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (0.21.0)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (2021.10.8)
Requirement already satisfied: urllib3[socks]~=1.26 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (1.26.7)
Requirement already satisfied: attrs>=19.2.0 in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (21.2.0)
Requirement already satisfied: async-generator>=1.9 in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.10)
Requirement already satisfied: cffi>=1.14 in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.14.6)
Requirement already satisfied: sortedcontainers in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: outcome in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: sniffio in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: idna in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.2)
Requirement already satisfied: pycparser in c:\users\admin\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.20)
Requirement already satisfied: wsproto>=0.14 in c:\users\admin\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.1.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\users\admin\anaconda3\lib\site-packages (from urllib3[socks]~=1.26->selenium) (1.7.1)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\admin\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.13.0)

In [38]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.common.exceptions import StaleElementReferenceException , NoSuchElementException
from selenium.webdriver.common.by import By
import time

Now we weill download webdriver for the web browser steps for download are 1. check the version of your browser 2.go to the link https://chromedriver.chromium.org/downloads 3.download teh webdriver for your browser of your version

In [53]:
driver=webdriver.Chrome(r"C:\Users\Admin\chromedriver.exe")

In [54]:
#Let first connect to the driver
driver=webdriver.Chrome(r"chromedriver.exe")

In [55]:
#opening naukri page on automated chrome browser
driver.get("https://www.naukri.com/")

In [42]:
#entering designation and location as required in the question
designation=driver.find_element(By.CLASS_NAME,"suggestor-input")
designation.send_keys('Data Analyst')

In [43]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[3]/div/div[1]/div[5]/div/div/div/input")
location.send_keys('Bangalore')

In [44]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [45]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [47]:
#scraping job title from the given webpage
title_tags=driver.find_elements(By.XPATH,'//a[@class="title fw500 ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)

In [48]:
#scraping job location
location_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi location"]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)

In [49]:
#scraping company name
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

In [50]:
#scraping job experience
experience_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi experience"]//span')
for i in experience_tags[0:10]:
    exp=i.text
    experience_required.append(exp)

In [51]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [52]:
df=pd.DataFrame({'Job Titiel':job_title,'Job Location':job_location,'Company Name':company_name,'Experience Required':experience_required})
df

,Job Titiel,Job Location,Company Name,Experience Required
0,Business & Data Analyst- Assistant Manager,"Bangalore/Bengaluru, Hyderabad/Secunderabad",State Street,1-3 Yrs
1,Sr. Business Data Analyst,Bangalore/Bengaluru,Infometry,4-6 Yrs
2,Senior Data Analyst,Bangalore/Bengaluru,Qualitest India Private Limited,5-8 Yrs
3,Sr Clinical Data Analyst,Bangalore/Bengaluru,LabCorp,2-5 Yrs
4,Manager / Senior Manager - Data Analyst,"Bangalore/Bengaluru, Mumbai, Hyderabad/Secunde...",Huquo Consulting Pvt. Ltd,2-7 Yrs
5,DATA Analyst- Immediate Joining,Bangalore/Bengaluru(Cox Town),ADVISETREE CONSULTING PRIVATE LIMITED,3-5 Yrs
6,Data Analyst,"Bangalore/Bengaluru, Ahmedabad",milestone internet marketing pvt ltd,2-7 Yrs
7,Data Analyst,Bangalore/Bengaluru,Bayer,2-5 Yrs
8,Senior Data Analyst,Bangalore/Bengaluru(Old Madras Road),KrazyBee,3-6 Yrs
9,Sr. Data Analyst,"Bangalore/Bengaluru, Pune",Global Indian School Education Services,6-11 Yrs

Q2: Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You
have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data.
This task will be done in following steps:
1. First get the webpage https://www.naukri.com/
2. Enter “Data Scientist” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the
location” field.
3. Then click the search button.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.

In [65]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [66]:
driver.get("https://www.naukri.com/")

In [67]:
designation=driver.find_element(By.CLASS_NAME,"suggestor-input")
designation.send_keys('Data Scientist')

In [68]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[3]/div/div/div[5]/div/div/div/input")
location.send_keys('Bangalore')

In [69]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [70]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [71]:
title_tags=driver.find_elements(By.XPATH,'//a[@class="title fw500 ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)

In [72]:
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

In [73]:
location_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi location"]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)

In [74]:
experience_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi experience"]//span')
for i in experience_tags[0:10]:
    exp=i.text
    experience_required.append(exp)

In [75]:
df=pd.DataFrame({'Job Title':job_title,'Job Location':job_location,'Company Name':company_name,'Experience Required':experience_required})
df

,Job Title,Job Location,Company Name,Experience Required
0,Lead ML Scientist,"Bangalore/Bengaluru, Mumbai",Fractal Analytics,6-10 Yrs
1,Senior Manager - EmTech - Machine Learning - P&T,"Bangalore/Bengaluru, Mumbai, Hyderabad/Secunde...",PwC,5-12 Yrs
2,Analystics & Modeling Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,6-8 Yrs
3,Data scientist _Tata Consultancy Services(Tcs),"Bangalore/Bengaluru, Kochi/Cochin, Indore, New...",TATA CONSULTANCY SERVICES (TCS),9-14 Yrs
4,Job||Job Opening For AI Technologist - Data Sc...,"Bangalore/Bengaluru, New Delhi, Hyderabad/Secu...",Wipro,5-10 Yrs
5,Hiring For DATA Scientist @ NTT DATA Business ...,"Bangalore/Bengaluru, Noida, Hyderabad/Secunder...",NTT DATA Business Solutions Private Limited,4-9 Yrs
6,Tcs Hiring For Data Scientist,"Bangalore/Bengaluru, Chennai, Mumbai (All Areas)",TATA CONSULTANCY SERVICES (TCS),3-8 Yrs
7,Urgent Job Opening For AI Practitioner - Data ...,"Bangalore/Bengaluru, Kochi/Cochin, New Delhi, ...",Wipro,11-20 Yrs
8,Data Scientist Lead_Tata Consultancy Services(...,"Bangalore/Bengaluru, Kolkata, Hyderabad/Secund...",TATA CONSULTANCY SERVICES (TCS),8-12 Yrs
9,Assistant Manager - Data Science,"Bangalore/Bengaluru, Mumbai, Pune",CitiusTech,5-9 Yrs

Q3: In this question you have to scrape data using the filters available on the webpage:
You have to use the location and salary filter.
You have to scrape data for “Data Scientist” designation for first 10 job results.
You have to scrape the job-title, job-location, company name, experience required.
The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs
The task will be done as shown in the below steps:
1. first get the webpage https://www.naukri.com/
2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.
3. Then click the search button.
4. Then apply the location filter and salary filter by checking the respective boxes
5. Then scrape the data for the first 10 jobs results you get.
6. Finally create a dataframe of the scraped data.

In [83]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [84]:
driver.get("https://www.naukri.com/")

In [85]:
designation=driver.find_element(By.CLASS_NAME,"suggestor-input")
designation.send_keys('Data Scientist')

In [86]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[3]/div/div/div[5]/div/div/div/input")
location.send_keys('Delhi')

In [87]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [88]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [89]:
title_tags=driver.find_elements(By.XPATH,'//a[@class="title fw500 ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)

In [90]:
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

In [91]:
location_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi location"]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)

In [92]:
experience_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi experience"]//span')
for i in experience_tags[0:10]:
    exp=i.text
    experience_required.append(exp)

In [93]:
df=pd.DataFrame({'Job Title':job_title,'Job Location':job_location,'Company Name':company_name,'Experience Required':experience_required})
df

,Job Title,Job Location,Company Name,Experience Required
0,Analystics & Modeling Specialist,"Kolkata, Mumbai, Hyderabad/Secunderabad, Pune,...",Accenture,6-8 Yrs
1,Data scientist _Tata Consultancy Services(Tcs),"New Delhi, Kochi/Cochin, Indore, Hyderabad/Sec...",TATA CONSULTANCY SERVICES (TCS),9-14 Yrs
2,Job||Job Opening For AI Technologist - Data Sc...,"New Delhi, Hyderabad/Secunderabad, Pune, Chenn...",Wipro,5-10 Yrs
3,Hiring For DATA Scientist @ NTT DATA Business ...,"Noida, Hyderabad/Secunderabad, Pune, Gurgaon/G...",NTT DATA Business Solutions Private Limited,4-9 Yrs
4,Urgent Job Opening For AI Practitioner - Data ...,"New Delhi, Kochi/Cochin, Bangalore/Bengaluru, ...",Wipro,11-20 Yrs
5,Data Scientist,"New Delhi, Pune, Gurgaon/Gurugram, Bangalore/B...",ZS Associates,5-8 Yrs
6,Opening_ Data Scientist_ Pelatro Solutions,"Delhi / NCR, Kolkata, Hyderabad/Secunderabad, ...",Pelatro Solutions,8-12 Yrs
7,Affine- Hiring For Data Science - Work from Home,"Delhi / NCR, Kolkata, Hyderabad/Secunderabad, ...",Affine,4-7 Yrs
8,Senior Data Science Engineer,"Gurgaon/Gurugram, Bangalore/Bengaluru, Mumbai ...",Fractal Analytics,5-9 Yrs
9,Forecasting Analyst/ Data Scientist (US Client),"Gurgaon/Gurugram, Bangalore/Bengaluru\n(WFH du...",Concentrix,3-8 Yrs

Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
1. Brand
2. Product Description
3. Price

To scrape the data you have to go through following steps:
1. Go to Flipkart webpage by url : https://www.flipkart.com/
2. Enter “sunglasses” in the search field where “search for products, brands and more” is written and
click the search icon
3. After that you will reach to the page having a lot of sunglasses. From this page you can scrap the
required data as usual.
4. After scraping data from the first page, go to the “Next” Button at the bottom other page , then
click on it.
5. Now scrape data from this page as usual
6. Repeat this until you get data for 100 sunglasses.

In [97]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [98]:
driver.get("http://www.flipkart.com/")

In [102]:
product=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[3]/div[1]/div[2]/div[2]/div/div[1]/div/div[2]")
product.click()

In [103]:
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [104]:
brand=[]
price=[]

In [113]:
brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_tags[0:100]:
    brnd=i.text
    brand.append(brnd)

In [114]:
price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in price_tags[0:100]:
    Rs=i.text
    price.append(Rs)

In [115]:
sunglasses=pd.DataFrame({'Brand':brand,"Price":price})

In [117]:
sunglasses

                Brand   Price
0            Fastrack    ₹799
1           Elligator    ₹298
2            Fastrack    ₹639
3       VINCENT CHASE    ₹749
4           New Specs    ₹264
..                ...     ...
115       john jacobs  ₹4,000
116     VINCENT CHASE    ₹849
117  HAMIW COLLECTION    ₹199
118     VINCENT CHASE    ₹949
119         ROYAL SON    ₹664

[120 rows x 2 columns]

Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone.
This task will be done in following steps:
1. First get the webpage https://www.flipkart.com/
2. Enter “iphone 11” in “Search” field .
3. Then click the search button.

 you have to scrape the tick marked attributes.These are:
1. Rating
2. Review summary
3. Full review
4. You have to scrape this data for first 100 reviews

In [188]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [189]:
driver.get("http://www.flipkart.com/")

In [190]:
Apple=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input")
Apple.send_keys('iphone11')

In [191]:
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [192]:
product=driver.find_element(By.CLASS_NAME,"_4rR01T")
product.click()

In [194]:
rating=[]
review_summary=[]
full_review=[]

In [209]:
rating_tags=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
for i in rating_tags[0:100]:
    RA=i.text
    rating.append(RA)

In [210]:
review_tags=driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
for i in review_tags[0:100]:
    Rev=i.text
    review_summary.append(Rev)

In [211]:
reviewfull_tags=driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
for i in reviewfull_tags[0:100]:
    FR=i.text
    full_review.append(FR)

In [212]:
print(len(rating),len(review_summary),len(full_review))

0 0 0

In [204]:
df=pd.DataFrame({'Rating':rating,'Review Summary':review_summary,'Full Review':full_review})
df

Empty DataFrame
Columns: [Rating, Review Summary, Full Review]
Index: []

Q6: Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the
search field.
You have to scrape 4 attributes of each sneaker:
1. Brand
2. Product Description
3. Price

In [213]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [214]:
driver.get("https://www.flipkart.com/")

In [215]:
findp=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input")
findp.click()

In [216]:
product=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input")
product.send_keys('Sneakers')

In [217]:
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [219]:
brand=[]
price=[]

In [226]:
brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_tags[0:100]:
    brnd=i.text
    brand.append(brnd)

In [227]:
price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in price_tags[0:100]:
    Prc=i.text
    price.append(Prc)

In [228]:
print(len(brand),len(price))

120 120

In [230]:
Sneakers=pd.DataFrame({'Brand':brand,"Price":price})
Sneakers[0:100]

          Brand   Price
0   ZF - ALFIYA    ₹499
1        ADIDAS  ₹1,305
2          aadi    ₹374
3          PUMA  ₹1,542
4        Chevit    ₹544
..          ...     ...
95       Kzaara    ₹289
96    DUNKASTON    ₹699
97       Kzaara    ₹259
98     HOTSTYLE    ₹262
99       ADIDAS  ₹2,267

[100 rows x 2 columns]

Q7: Go to the link - https://www.myntra.com/shoes
Set second Price filter and Color filter to “Black”,
And then scrape First 100 shoes data you get. The data should include “Brand” of the shoes , Short Shoe
description, price of the shoe as shown in the below image.

In [231]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [232]:
driver.get("https://www.myntra.com/shoes")

In [233]:
price=driver.find_element(By.XPATH,"/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[5]/ul/li[2]/label")
price.click()

In [234]:
colour=driver.find_element(By.XPATH,"/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[6]/ul/li[1]/label/span[1]")
colour.click()

In [235]:
brand=[]
price=[]
product_description=[]

In [240]:
brand_tags=driver.find_elements(By.XPATH,'//h3[@class="product-brand"]')
for i in brand_tags[0:100]:
    brnd=i.text
    brand.append(brnd)

In [241]:
price_tags=driver.find_elements(By.XPATH,'//div[@class="product-price"]')
for i in price_tags[0:100]:
    Prc=i.text
    price.append(Prc)

In [242]:
product_tags=driver.find_elements(By.XPATH,'//h4[@class="product-product"]')
for i in product_tags[0:100]:
    des=i.text
    product_description.append(des)

In [243]:
print(len(brand),len(price),len(product_description))

100 100 100

In [244]:
Shoes=pd.DataFrame({'Brand':brand,'Price':price,'Product Description':product_description})
Shoes

       Brand                        Price             Product Description
0       Nike    Rs. 7465Rs. 8295(10% OFF)  Men ZOOM WINFLO8 Running Shoes
1   Skechers    Rs. 7199Rs. 8999(20% OFF)      Men Max Cushioning Running
2       Nike  Rs. 11895Rs. 13995(15% OFF)    Men React Infinity 3 Running
3       Nike    Rs. 8005Rs. 8895(10% OFF)     Men SRG 3 FK Training Shoes
4     ADIDAS   Rs. 6719Rs. 13999(52% OFF)       Women X9000 H.RDY Running
..       ...                          ...                             ...
95  DAVINCHI                     Rs. 6990      Solid Leather Formal Boots
96      Geox    Rs. 6643Rs. 9490(30% OFF)  Women Textured Leather Loafers
97      Puma    Rs. 6799Rs. 7999(15% OFF)     Cali Dream Leather Sneakers
98  Columbia                     Rs. 7999   Women REDMOND V2 TrekkingShoe
99  Columbia                     Rs. 9999  PEAKFREAK OUTDRY Trekking Shoe

[100 rows x 3 columns]

Q8: Go to webpage https://www.amazon.in/
Enter “Laptop” in the search field and then click the search icon.
Then set CPU Type filter to “Intel Core i7” as shown in the below image:
After setting the filters scrape first 10 laptops data. You have to scrape 3 attributesfor each laptop:
1. Title
2. Ratings
3. Price

In [245]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [246]:
driver.get("https://www.amazon.in/")

In [247]:
product=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
product.send_keys('Laptops')

In [248]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div")
search.click()

In [249]:
CPU=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[4]/li[14]/span/a/span")
CPU.click()

In [250]:
title=[]
rating=[]
price=[]

In [251]:
title_tags=driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
for i in title_tags[0:10]:
    tit=i.text
    title.append(tit)

In [252]:
price_tags=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in price_tags[0:10]:
    Prc=i.text
    price.append(Prc)

In [262]:
rating_tags=driver.find_elements(By.XPATH,'//a[@class="a-icon-alt"]//span')
for i in rating_tags[0:10]:
    Rtng=i.text
    rating.append(Rtng)

In [263]:
print(len(rating), len(title),len(price))

30 10 10

In [264]:
laptop=pd.DataFrame({'Rating':rating[0:10],'Title':title,'Price':price})
laptop[0:10]

  Rating                                              Title     Price
0         Lenovo Ideapad Gaming 3 Intel Core i7 10th Gen...    62,990
1         HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...    87,990
2         ASUS Vivobook 15, 15.6-inch (39.62 cms) FHD, I...    57,990
3         ASUS TUF Gaming F15 (2022), 15.6-inch (39.62 c...  1,09,990
4         Lenovo ThinkPad E14 Intel Core i7 11th Gen 14-...    94,990
5         ASUS TUF Gaming F15 (2022), 15.6" (39.62 cms) ...  1,09,990
6         HP Pavilion Plus, 12th Gen Intel Core i7 16GB ...    89,990
7         Samsung Galaxy Book2 Intel 12th Gen core i7 39...    79,490
8         Lenovo IdeaPad Slim 5 Intel Core i7 12th Gen 1...    81,990
9         (Renewed) Dell Latitude E7470 Intel Core i7 6t...    38,899

Q9: Write a python program to scrape data for first 10 job results for Data Scientist Designation in Noida
location. You have to scrape company name, No. of days ago when job was posted, Rating of the company.
This task will be done in following steps:
1. First get the webpage https://www.ambitionbox.com/
2. Click on the Job option 
3. After reaching to the next webpage, In place of “Search by Designations, Companies, Skills” enter
“Data Scientist” and click on search button.
4. You will reach to the following web page click on location and in place of “Search location” enter
“Noida” and select location “Noida”.
5. Then scrape the data for the first 10 jobs results you get on the above shown page.
6. Finally create a dataframe of the scraped data

In [265]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [266]:
driver.get("https://www.ambitionbox.com/")

In [267]:
jobs=driver.find_element(By.XPATH,"/html/body/div[1]/nav[2]/div/ul/li[5]/a")
jobs.click()

In [268]:
designation=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[1]/div/div/div/div/span/input")
designation.send_keys('Data Scientist')

In [269]:
search=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[1]/div/div/div/button")
search.click()

In [270]:
select=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[2]/div[1]/div/div/div/div[2]/div[1]/i")
select.click()

In [271]:
location=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[2]/input")
location.send_keys('Noida')

In [272]:
GrN=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[3]/div[1]/div[1]/div/label")
GrN.click()

In [293]:
company_name=[]
days=[]

In [286]:
days_tags=driver.find_elements(By.XPATH,'//span[@class="body-small-l"]')
for i in days_tags[0:10]:
    dy=i.text
    days.append(dy)

In [291]:
company_tags=driver.find_elements(By.XPATH,'//div[@class="body-small"]')
for i in company_tags[0:10]:
    cmpny=i.text
    company_name.append(cmpny)

In [290]:
Jobs=pd.DataFrame({'No. of days ago':days[0:10],'Company Name':company_name[0:10]})
Jobs

   No. of days ago                                       Company Name
0    posted 8d ago  CBRE South Asia Pvt Ltd\n · \n4.3\nbased on 2....
1           8d ago       CBRE South Asia Pvt Ltd\n4.3\n(2.3k Reviews)
2   via naukri.com  GENPACT India Private Limited\n4.0\n(19.9k Rev...
3           1d ago                      Genpact\n4.0\n(19.9k Reviews)
4   via naukri.com  Ericsson India Global Services Pvt. Ltd.\n4.3\...
5           3d ago  GENPACT India Private Limited\n4.0\n(19.9k Rev...
6  via iimjobs.com  Optum Global Solutions (India) Private Limited...
7          18d ago  Optum Global Solutions (India) Private Limited...
8   via naukri.com  Ericsson India Global Services Pvt. Ltd.\n4.3\...
9          11d ago    SOPRA STERIA INDIA LIMITED\n4.2\n(1.2k Reviews)

Q10: Write a python program to scrape the salary data for Data Scientist designation.
You have to scrape Company name, Number of salaries, Average salary, Minsalary, Max Salary.
The above task will be, done as shown in the below steps:
1. First get the webpage https://www.ambitionbox.com/
2. Click on the salaries option 
3. After reaching to the following webpage, In place of “Search Job Profile” enters “Data Scientist” and
then click on “Data Scientist”.
You have to scrape the data ticked in the above image.
4. Scrape the data for the first 10 companies. Scrape the company name, total salary record, average
salary, minimum salary, maximum salary, experience required.
5. Store the data in a dataframe

In [301]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [302]:
driver.get("https://www.ambitionbox.com/")

In [303]:
Select=driver.find_element(By.XPATH,"/html/body/div[1]/nav[2]/div/ul/li[3]/a")
Select.click()

In [304]:
bsalary=driver.find_element(By.XPATH,"/html/body/div[1]/nav[2]/div/ul/li[3]/div/ul/li[1]/div")
bsalary.click()

In [305]:
designation=driver.find_element(By.XPATH,"/html/body/div/div/div/main/section[1]/div[2]/div[1]/span/input")
designation.send_keys('Data Scientist')

In [306]:
dclick=driver.find_element(By.XPATH,"/html/body/div/div/div/main/section[1]/div[2]/div[1]/span/div/div/div[1]")
dclick.click()

In [307]:
Experience_Required=[]
company_name=[]
Total_Salary=[]
Average=[]
Minimum=[]
Maximum=[]

In [312]:
experience_tags=driver.find_elements(By.XPATH,'//div[@class="sbold-list-header"]')
for i in experience_tags[0:10]:
    exp=i.text
    Experience_Required.append(exp)

In [314]:
company_tags=driver.find_elements(By.XPATH,'//div[@class="company-info"]//a')
for i in company_tags[0:10]:
    com=i.text
    company_name.append(com)

In [315]:
avg_tags=driver.find_elements(By.XPATH,'//p[@class="averageCtc"]')
for i in avg_tags[0:10]:
    avg=i.text
    Average.append(avg)

In [316]:
TSR_tags=driver.find_elements(By.XPATH,'//span[@class="datapoints"]')
for i in TSR_tags[0:10]:
    TotalR=i.text
    Total_Salary.append(TotalR)

In [318]:
min_tags=driver.find_elements(By.XPATH,"/html/body/div/div/div/main/section[1]/div[2]/div[3]/div[2]/div[1]/div[2]/div/div[2]/div[1]")
for i in min_tags[0:10]:
    minm=i.text
    Minimum.append(minm)

In [321]:
max_tags=driver.find_elements(By.XPATH,'//div[@class="value body-medium"]')
for i in max_tags[0:10]:
    maxm=i.text
    Maximum.append(maxm)

In [323]:
print(len(Experience_Required),len(company_name),len(Total_Salary),len(Minimum),len(Maximum),len(Average))

10 20 10 11 11 10

In [326]:
Records=pd.DataFrame({'Company Name':company_name[0:10],"Experience Required":Experience_Required,"Total Salary Record":Total_Salary,"Maximum Salary":Maximum[0:10], "Minimum Salary":Minimum[0:10],"Average Salary":Average})
Records[0:10]

,Company Name,Experience Required,Total Salary Record,Maximum Salary,Minimum Salary,Average Salary
0,Walmart\nData Scientist Salary,3-4 yrs experience (based on 22 salaries),(based on 22 salaries),₹ 45.0L,₹ 25.0L,₹ 31.7L
1,Ab Inbev\nData Scientist Salary,2-4 yrs experience (based on 53 salaries),(based on 53 salaries),₹ 25.0L,₹ 45.0L,₹ 19.7L
2,Optum\nData Scientist Salary,2-4 yrs experience (based on 48 salaries),(based on 48 salaries),₹ 45.0L,₹ 15.0L,₹ 16.5L
3,ZS\nData Scientist Salary,1-2 yrs experience (based on 33 salaries),(based on 33 salaries),₹ 15.0L,₹ 25.5L,₹ 15.7L
4,Fractal Analytics\nData Scientist Salary,2-4 yrs experience (based on 109 salaries),(based on 109 salaries),₹ 25.5L,₹ 11.0L,₹ 15.2L
5,Tiger Analytics\nData Scientist Salary,2-4 yrs experience (based on 65 salaries),(based on 65 salaries),₹ 11.0L,₹ 22.6L,₹ 14.7L
6,Legato Health Technologies\nData Scientist Salary,4 yrs experience (based on 11 salaries),(based on 11 salaries),₹ 22.6L,₹ 11.0L,₹ 14.5L
7,Tredence\nData Scientist Salary,3 yrs experience (based on 12 salaries),(based on 12 salaries),₹ 11.0L,₹ 22.0L,₹ 14.1L
8,UnitedHealth\nData Scientist Salary,2-4 yrs experience (based on 91 salaries),(based on 91 salaries),₹ 22.0L,₹ 9.0L,₹ 13.6L
9,Ford Motor\nData Scientist Salary,3-4 yrs experience (based on 21 salaries),(based on 21 salaries),₹ 9.0L,₹ 23.0L,₹ 13.5L

In [ ]:
#completed